### Forest: snapshot-service Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
data.local_file.init: Reading...
data.local_file.init: Read complete after 0s [id=77298e3fbe90b09f523af110328b6459bffa71c6]
data.digitalocean_ssh_keys.keys: Reading...
data.external.sources_tar: Reading...
data.digitalocean_project.forest_project: Reading...
module.monitoring[0].newrelic_alert_policy.alert: Refreshing state... [id=1328184]
module.monitoring[0].newrelic_notification_channel.slack-channel[0]: Refreshing state... [id=9f4ba0fe-e252-43d9-b068-a5723b7690e4]
data.external.sources_tar: Read complete after 0s [id=-]
data.local_file.sources: Reading...
data.local_file.sources: Read complete after 0s [id=3c241b935b31509a66a77870f804ed3c0161382b]
data.digitalocean_ssh_keys.keys: Read complete after 0s [id=ssh_keys/8656000852680004208]
digitalocean_droplet.forest: Refreshing state... [id=409507753]
digitalocean_firewall.forest-firewall: Refreshing state... [id=d9ef4283-8670-463c-b48e-aabfb3020418]
data.digitalocean_project.forest_project: Read complete after 1s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.monitoring[0].newrelic_nrql_alert_condition.disk_space: Refreshing state... [id=1328184:6098417]
module.monitoring[0].newrelic_workflow.alerting-workflow-slack[0]: Refreshing state... [id=452bb9c6-e7ee-4c5e-88f3-43f79e9cde00]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # digitalocean_droplet.forest must be replaced
-/+ resource "digitalocean_droplet" "forest" {
      ~ created_at           = "2024-03-28T12:44:29Z" -> (known after apply)
      ~ disk                 = 200 -> (known after apply)
      ~ id                   = "409507753" -> (known after apply)
      ~ ipv4_address         = "167.172.96.40" -> (known after apply)
      ~ ipv4_address_private = "10.135.0.3" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 16384 -> (known after apply)
        name                 = "prod-forest-snapshot"
      ~ price_hourly         = 0.125 -> (known after apply)
      ~ price_monthly        = 84 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "iac",
            "prod",
        ]
      ~ urn                  = "do:droplet:409507753" -> (known after apply)
      ~ user_data            = (sensitive value) # forces replacement
      ~ vcpus                = 4 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # digitalocean_firewall.forest-firewall will be updated in-place
  ~ resource "digitalocean_firewall" "forest-firewall" {
      ~ droplet_ids     = [
          - 409507753,
        ] -> (known after apply)
        id              = "d9ef4283-8670-463c-b48e-aabfb3020418"
        name            = "prod-forest-snapshot"
        tags            = []
        # (3 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # digitalocean_project_resources.connect_forest_project will be updated in-place
  ~ resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      ~ resources = [
          - "do:droplet:409507753",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ ip = [
      - "167.172.96.40",
      + (known after apply),
    ]

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/forest-iac/forest-iac/tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/forest-iac/forest-iac/tfplan"
```

</details>